# Pandas

Copyright 2023 Marco A. Lopez-Sanchez.  
Content under [Creative Commons Attribution license CC-BY 4.0](https://creativecommons.org/licenses/by/4.0/).

> **Goal**:  
> Learn the basics of Pandas library
>
> **What it is?**  
>A library for dealing with tabular data structures that includes efficient methods for reading and writing a wide variety of data (e.g. CSV files, Excel, etc.) and built-in plotting capabilities for explore the data. 
>
> **What it is used for?**  
>This is Python's default library for manipulating tabular-like datasets. Pandas adds to Python two data structures, called Series and DataFrames, as well as all the expected functionality for dealing with these data structures. Here we will focus on DataFrames, a 2D tabular data structure with labelled axes (rows and columns) in which columns are of potentially different types. If you normally use Excel-like applications to process your data, chances are that this will be your daily buddy in Python.
>
> **Resources**  
> https://pandas.pydata.org/ (official website)  
> https://pandas.pydata.org/docs/ (official documentation)  
> [Python for Data Analysis](https://wesmckinney.com/book/preliminaries.html#navigating_book): A nice book focus on Pandas from the main author of Pandas Wes McKinney

In [1]:
# how to import pandas
import pandas as pd

## Creating DataFrame

In [2]:
# create data using a Python dict
# (example taken from https://wesmckinney.com/book/pandas-basics.html)
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

# create a DataFrame
df = pd.DataFrame(data)

df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2


### Importing tabular data from files

TODO

In [3]:
dataset = pd.read_csv('data/bulk_composition.csv', delimiter=';')
dataset

,Unnamed: 0,primitive mantle,mean lower crust,CO_eclogite,CO_granulite,CO_pyroxenite,Unnamed: 6
0,SiO2,44.91,53.40,48.44,48.41,50.94,NaN
1,TiO2,0.16,0.82,1.06,1.19,0.11,NaN
2,Al2O3,4.44,16.90,15.54,16.95,3.24,NaN
3,Fe2O3t,8.05,8.57,11.06,13.93,6.12,NaN
4,MnO,0.13,0.10,0.18,0.25,0.14,NaN
5,MgO,37.81,7.24,8.84,5.44,21.84,NaN
6,CaO,3.54,9.59,12.31,10.43,14.87,NaN
7,Na2O,0.36,2.65,1.89,1.66,0.33,NaN
8,K2O,0.03,0.61,0.12,0.62,0.05,NaN
9,P2O5,0.02,0.10,0.12,0.44,0.01,NaN
10,LOI,NaN,NaN,0.66,0.62,1.59,NaN

In [4]:
# drop the last column
dataset = dataset.drop(columns=['Unnamed: 6'])

In [5]:
dataset.head() # head() method selects only the first five rows by default

,Unnamed: 0,primitive mantle,mean lower crust,CO_eclogite,CO_granulite,CO_pyroxenite
0,SiO2,44.91,53.40,48.44,48.41,50.94
1,TiO2,0.16,0.82,1.06,1.19,0.11
2,Al2O3,4.44,16.90,15.54,16.95,3.24
3,Fe2O3t,8.05,8.57,11.06,13.93,6.12
4,MnO,0.13,0.10,0.18,0.25,0.14


### Inspecting your data

TODO

In [6]:
# check all the data types in a dataframe (alternative: dataset.dtypes)
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        11 non-null     object
 1   primitive mantle  10 non-null     float64
 2   mean lower crust  10 non-null     float64
 3   CO_eclogite       11 non-null     float64
 4   CO_granulite      11 non-null     float64
 5   CO_pyroxenite     11 non-null     float64
dtypes: float64(5), object(1)
memory usage: 656.0+ bytes

## Modify your dataframes

TODO: Subset, extend, reshape, sort, filtering, groupby, dealing with missing values



### Handling missing values

When loading a dataframe from a CSV file or similar, an empty value in a numeric column will become NaN or ``np.nan``, which means "not a number" (some synonyms are ``null``, ``None``, ``nan`` or ``<NA>``). Pandas has several methods for dealing with these missing values. Here, we will show examples of the following methods (the names are quite explicit): ``.info()``, ``.isna()``, ``.notna()``, ``.fillna()``, ``.dropna()``

In [7]:
# check if there are values with missing values in your dataset
dataset['primitive mantle'].isna()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
Name: primitive mantle, dtype: bool

In [8]:
# drop all rows with nan values
dataset.dropna()

,Unnamed: 0,primitive mantle,mean lower crust,CO_eclogite,CO_granulite,CO_pyroxenite
0,SiO2,44.91,53.40,48.44,48.41,50.94
1,TiO2,0.16,0.82,1.06,1.19,0.11
2,Al2O3,4.44,16.90,15.54,16.95,3.24
3,Fe2O3t,8.05,8.57,11.06,13.93,6.12
4,MnO,0.13,0.10,0.18,0.25,0.14
5,MgO,37.81,7.24,8.84,5.44,21.84
6,CaO,3.54,9.59,12.31,10.43,14.87
7,Na2O,0.36,2.65,1.89,1.66,0.33
8,K2O,0.03,0.61,0.12,0.62,0.05
9,P2O5,0.02,0.10,0.12,0.44,0.01

In [9]:
# drop only the rows that are all nans, for columns will be: .dropna(axis="columns", how="all")
dataset.dropna(how="all")

,Unnamed: 0,primitive mantle,mean lower crust,CO_eclogite,CO_granulite,CO_pyroxenite
0,SiO2,44.91,53.40,48.44,48.41,50.94
1,TiO2,0.16,0.82,1.06,1.19,0.11
2,Al2O3,4.44,16.90,15.54,16.95,3.24
3,Fe2O3t,8.05,8.57,11.06,13.93,6.12
4,MnO,0.13,0.10,0.18,0.25,0.14
5,MgO,37.81,7.24,8.84,5.44,21.84
6,CaO,3.54,9.59,12.31,10.43,14.87
7,Na2O,0.36,2.65,1.89,1.66,0.33
8,K2O,0.03,0.61,0.12,0.62,0.05
9,P2O5,0.02,0.10,0.12,0.44,0.01
10,LOI,NaN,NaN,0.66,0.62,1.59

In [10]:
# fill null values with an specific value
dataset.fillna(0.0)

,Unnamed: 0,primitive mantle,mean lower crust,CO_eclogite,CO_granulite,CO_pyroxenite
0,SiO2,44.91,53.40,48.44,48.41,50.94
1,TiO2,0.16,0.82,1.06,1.19,0.11
2,Al2O3,4.44,16.90,15.54,16.95,3.24
3,Fe2O3t,8.05,8.57,11.06,13.93,6.12
4,MnO,0.13,0.10,0.18,0.25,0.14
5,MgO,37.81,7.24,8.84,5.44,21.84
6,CaO,3.54,9.59,12.31,10.43,14.87
7,Na2O,0.36,2.65,1.89,1.66,0.33
8,K2O,0.03,0.61,0.12,0.62,0.05
9,P2O5,0.02,0.10,0.12,0.44,0.01
10,LOI,0.00,0.00,0.66,0.62,1.59

### Selecting your data

TODO

In [11]:
# based on dtype
dataset.select_dtypes("float64").head()

,primitive mantle,mean lower crust,CO_eclogite,CO_granulite,CO_pyroxenite
0,44.91,53.40,48.44,48.41,50.94
1,0.16,0.82,1.06,1.19,0.11
2,4.44,16.90,15.54,16.95,3.24
3,8.05,8.57,11.06,13.93,6.12
4,0.13,0.10,0.18,0.25,0.14

## Using of Pandas' plotting capabilities

TODO

In [12]:
import sys
print('Notebook tested using:')
print('Python', sys.version)
print('Pandas', pd.__version__)

Notebook tested using:
Python 3.10.10 | packaged by Anaconda, Inc. | (main, Mar 21 2023, 18:39:17) [MSC v.1916 64 bit (AMD64)]
Pandas 1.5.3